[
    {
        "title": "Deal Of The Day – Upto 80% Off On Smartphones, Fashion, Electronics, Appliances & More",
        "description": "Now Get Upto 80% Off On Smartphones, Fashion, Electronics, Appliances & More At Flipkart. Shop From Categories Such As Clothing, Footwear, Watches, Sunglasses, Bags, Perfumes, Grocery, Air Conditioner, Air Cooler, Mobile Phones, Television, Electronics, Refrigerators, Washing Machine, Microwave, Laptops, Cameras, Home And Kitchen Products, Headphones, Speakers, Kitchen Appliances, Trimmers and Shavers, Printers, Mobile Accessories, Baby Products, Home Furnishing, Home Decor, Furniture & Many More. Just Checkout The Landing Page To Grab The Product At The Best Price.",
        "link": "https://dl.flipkart.com/dl/?affid=vishwajit8&affExtParam1=DEALSOFTHEDAY&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Electronics – Upto 80% Off On To Brands Electronics & Accessories",
        "description": "Now Get Upto 80% Off On Electronics & Accessories. Shop From Headphones, Speakers, Smartwatches, Laptops, Trimmers Cameras, Mobile Accessories, Printers, Tablets Data Storage & More Shown On The Deal Page. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/flipkart-electronics-new-store?affid=vishwajit8&affExtParam1=ELECTRONICSMAIN&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Mobile Phones – Upto Rs.15,000 Off + Exchange & No Cost EMI",
        "description": "Now Get Upto Rs.15,000 Off On Best Selling Mobile Phones. Choose Latest Mobile Phones From All Top Mobile Brands Like Apple, Motorola, Samsung, Honor, Vivo, Oppo, Xiaomi, Lenovo, Asus Zenfones, Nokia And More. Check Out Newly Launched Smartphones Such As Realme 9i, Realme GT Master, Realme C25Y, Realme Narzo 50i, Realme Narzo 50A, POCO C31, POCO F3 GT, POCO M3 Pro 5G, Xiaomi 11i 5G, Redmi Note 11T 5G, Redmi Note 10 Lite, Redmi 9A Sport, iPhone SE, iPhone 12 Series, iPhone 13 Series, Motorola Edge 20 Fusion, Motorola G60, Oppo Reno7 Pro 5G, Oppo A16k, Oppo A55, Oppo Reno6 Pro 5G, Oppo F19s, IQOO 3 & More. Get Upto Rs.17,500 Off On Old Phone Exchange. No Cost EMI Also Available. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/mobile-phones-store?affid=vishwajit8&affExtParam1=MOBILEPHONE&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Laptop Deals – Upto 50% Off On Laptops + No Cost EMI & Exchange",
        "description": "Get Upto 50% Off On Laptops Listed On The Offer Page. Laptops Are From Top Brands Like –  Acer, HP, Asus, Lenovo, Apple, Microsoft Etc. Lined Up Options Have Many Features Based On Different Requirements Of Different Buyers. Some Of The Features Are – Dedicated Graphics Memory Varies From 128 MB To 8 GB, Windows 10 Home, Screen Sizes, Processor, OS & More. Also, Get Upto 18100 Off On Exchange & No Cost EMI From Various Brands At Time Of Payment. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/laptops/pr?sid=6bo%2Cb5g&affid=vishwajit8&affExtParam1=LAPTOPS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "TVs & Appliances – Upto 75% Off TV And Accessories + Exchange & No Cost EMI",
        "description": "Now Get Upto 75% Off On TVs & Appliances Shown On The Deal Page. Shop From Television, Refrigerator, Air Conditioners, Microwave, Kitchen Appliances & More. Exchange & No Cost EMI Offers Are Also Available. Checkout The Landing Page To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/tvs-and-appliances-new-clp-store?affid=vishwajit8&affExtParam1=TVANDAPPLIACES&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Fashion And Lifestyle – Min 30%- 70% Off On Fashion & Lifestyle Products & Accessories",
        "description": "Now Get Min 30% – 70% Off On Fashion & Lifestyle Products. Shop From 10k+ Authentic Brands & 1 Crore+ Styles Includes Men’s Clothing, Women’s Clothing, Kids Fashion, Men’s Footwear, Women’s Footwear, Bags, Accessories, Artificial Jewellery & More. Products Are From Top Brand Like Adidas, Puma, Levis, UCB, Flying Machine & More. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/fashion-ikfc9-nu-store?affid=vishwajit8&affExtParam1=FASHION&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Headphones & Speakers – Min 50% Off On Earphones, Headsets,True Wireless & More",
        "description": "Now Get Min 50% Off On Headphones & Speakers Includes Earphone, Portable Speakers, Headset, Soundbar & More. Discount May Vary From Product To Product. Checkout The Landing Page For Amazing Deals.",
        "link": "https://dl.flipkart.com/dl/audio-video/pr?sid=0pm&p%5B%5D=facets.discount_range_v1%255B%255D%3D50%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=HEADPHONESANDSPEAKERS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Smart Watches – Min 30% To 80% Off On Noise, Boat, Apple & More",
        "description": "Avail Minimum 30% To 80% Off On Top Brand Watches Like Fossil, Samsung, Noise, Realme, Apple & More At Flipkart. Discount May Vary From Product To Product. Checkout The Landing Page Amazing Deals.",
        "link": "https://dl.flipkart.com/dl/wearable-smart-devices/smart-watches/pr?sid=ajy%2Cbuh&p%5B%5D=facets.discount_range_v1%255B%255D%3D30%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=SMARTWATCHMIN30&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Home & Furniture – Upto 80% Off On Home Furniture",
        "description": "Now Get Upto 80% Off On Home & Kitchen Products. Furnishing, Decors, Cookware, Home Tools & Many More. Get Extra 10% Off Federal Bank Credit Card Transaction Upto Rs.3000 On Order Of Rs.5000 & Above. Click On The Link To Grab The Offer. Click On The Link To Know More.",
        "link": "https://dl.flipkart.com/dl/furniture-furniturestudio-store?pageUID=1672631796523&affid=vishwajit8&affExtParam1=FURNITURE&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Beauty & Grooming – Min 30% To 70% Off On Makeup, Skin/Face/Hair Care, Fragrances & More",
        "description": "Now Get Min 30% To 70% Off On Beauty, Grooming, Fragrances & More. Offer Includes Brands Like Lakme, Maybelline, Himalaya, Olay & More. Discount May Vary From Product To Product. Visit The Landing Page To Avail The Products At Best Discounted Price Now.",
        "link": "https://dl.flipkart.com/dl/beauty-and-grooming/pr?sid=g9b&p%5B%5D=facets.discount_range_v1%255B%255D%3D30%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=BEAUTY&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Television Store – Upto 70% Off Televisions + No Cost EMI & Exchange",
        "description": "Get Upto 70% Off On Smart TV, LED, LCD, Full HD, Premium Ultra HD Televisions From Top Brands Such As LG, Samsung, Mi Tv, VU & More. Also, Get Upto Rs.11,000 Off On Exchange & No Cost EMI From Various Banks At The Time Of Payment. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/television-clp-store?pageUID=1672631959033&affid=vishwajit8&affExtParam1=TV&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Washing Machines – Upto 60% Off On Washing Machine + Exchange & No Cost EMI",
        "description": "Get Upto 60% Off On Washing Machines. Select From A Wide Range Of Front Loading, Top Loading & Semi-Automatic Washing Machines. Brands Like LG, Samsung, BPL, Onida & More. Also, Get No Cost EMI Offers & Exchange Offers On Few Products. Visit The Landing Page To Avail The Products At Best Discounted Price Now.",
        "link": "https://dl.flipkart.com/dl/washing-machine-metro-store?param=909890&pageUID=1672632066025&affid=vishwajit8&affExtParam1=WASHING&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Home & Kitchen Appliances – Upto 70% Off + No Cost EMI",
        "description": "Now Avail Upto 70% Off On Home & Kitchen Products. Shop From Varieties Of Mixer Juicer Grinder, Cooktops, Blenders, Chimney, Dish Washers & More Of Brands Like Samsung, LG, IFB, Phillips & More. No Cost EMI Offers Also Available. Checkout The Landing Page For Amazing Deals.",
        "link": "https://dl.flipkart.com/dl/home-kitchen/pr?sid=j9e&affid=vishwajit8&affExtParam1=HOMEANDKITCHEN&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Kitchen Appliances – Upto 75% Off On Kitchen Appliances + No Cost EMI Offers",
        "description": "Now Avail Upto 75% Off On Kitchen Appliances From Top Brands. Shop From 30,000+ Products & 5,000+ Brands Includes Mixer Juicer Grinder, Cooktops, Blenders, Chimney, Dish Washers & More Of Brands Like Samsung, LG, IFB, Phillips & More. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/kitchen-appliances-for-you-store?param=999&pageUID=1672632209468&affid=vishwajit8&affExtParam1=KITCHEN&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Geyser, Heaters & More – Upto 70% Off On Geyser & Heaters + No Cost EMI",
        "description": "Avail Upto 70% Off On Geysers, Immersion Rods & More Shown On The Page. Discount May Vary From Product To Product.  Get Extra 10% Off Federal Bank Credit Card Transaction Upto Rs.3000 On Order Of Rs.5000 & Above. Also, Avail No Cost EMI Offer From Top Banks At The Time Of Payments. Just Visit The Landing Page To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/flipkart-heating-days-new-store?affid=vishwajit8&affExtParam1=SEASONAL&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Refrigerators Deals – Upto 60% Off On Refrigerator + Exchange & No Cost EMI",
        "description": "Get Upto 60% Off On Refrigerators From Brands Like Samsung, Whirlpool, LG, Hitachi, Haier, Godrej, Bosch, Electrolux, MarQ, Mitashi, Panasonic & More. Select From Various Types Of Single-Door, Double Door, Triple Door, Side by Side, Portable & More. Also, Get No Cost EMI & Exchange Offers On Select Products. Click On The Link To Know More.",
        "link": "https://dl.flipkart.com/dl/refrigerators/pr?sid=j9e%2Cabm%2Chzg&affid=vishwajit8&affExtParam1=REFRIGERATOR&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Air Conditioner – Upto 55% Off On Top Brands Air Conditioner + Exchange & No Cost EMI",
        "description": "Get Upto 55% Off On Best-Selling Air Conditioners Like Blue Star, Hitachi, Sansui, Videocon, Kenstar, Carrier, Daikin, Samsung, LG, Voltas & More Offers Are Available On Window As Well As Split ACs. Visit The Landing Page To Know More.",
        "link": "https://dl.flipkart.com/dl/air-conditioners/pr?sid=c54&affid=vishwajit8&affExtParam1=ACS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Home Appliances – Upto 70% Off On Home Appliances + No Cost EMI Offers",
        "description": "Now Get Upto 70% Off On Home Appliances Includes Water Purifiers, Vacuum Cleaners, Inverters & More. Discount May Vary From Product To Product. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/home-kitchen/home-appliances/pr?sid=j9e%2Cabm&affid=vishwajit8&affExtParam1=HOMEAPPPLIANCES&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Clothing Sale – Min 40% Off On Men’s And Women’s Clothing And Accessories",
        "description": "Get Minimum 40% Off On Men, Women & Kids Clothing. Products Are From Top Brand Like Wrangler, Adidas, Puma, Lee, Flying Machine, US Polo, & More. Discount May Vary From Product To Product. Checkout The Landing Page For Amazing Deals.",
        "link": "https://dl.flipkart.com/dl/clothing-and-accessories/pr?sid=clo&p%5B%5D=facets.discount_range_v1%255B%255D%3D40%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=CLOTHING&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Footwear Store – Min 30% To 70% Off On Adidas, Puma, Reebok & More",
        "description": "Get Flat 30% To 70% Off On Footwear Listed On The Offer Page. Offer Page Also Includes Footwear From Top Brand Like Such As Puma, Nike, Adidas, Lotto, Red Tape, Fila, Reebok, Benetton, Woodland, Lotto, Provogue, Cara Mia, Ducati, Lavie, Fila, United Colors of Benetton, Vans & More. Avail Offers On Sports Shoes, Formal Shoes, Casual Shoes, Boots, Flip Flops, Sandals, Slippers and More. Checkout The Landing Page For Amazing Deals.",
        "link": "https://dl.flipkart.com/dl/footwear/pr?sid=osp&p%5B%5D=facets.discount_range_v1%255B%255D%3D30%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=FOOTWEAR&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Watches Store – Min 30% To 90% Off On Casio, Fossil, Fastrack & More",
        "description": "Get Min 30% To 90% Off On Wide Range of Watches For Men, Women and Kids Displayed On the Offer Page. Offer Includes Brands Such As Fossil, Fastrack, Diesel, Titan, Timex, Casio & More. Discount May Vary From Product To Product. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/watches/pr?p%5B%5D=facets.discount_range_v1%5B%5D%3D30%25+or+more&sid=r18&affid=vishwajit8&affExtParam1=WATCHES&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Bags, Wallets, Luggage & Backpacks – Flat 30% To 80% Off On Bags, Trolleys & More",
        "description": "Get Flat 30% To 80% Off On Bags, Trolleys & More Listed On The Offer Page. Bags  Are From Top Brands Like Skybags, American Tourister, Puma, Metronaut, Wildcraft & More. Visit The Landing Page To Avail The Products At Best Discounted Price Now.",
        "link": "https://dl.flipkart.com/dl/bags-wallets-belts/pr?sid=reh&p%5B%5D=facets.discount_range_v1%255B%255D%3D30%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=BAGSMAIN&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Cameras – Upto 40% Off On Top Brands + No Cost EMI Offers",
        "description": "Now Get Upto 50% Off On Cameras, Lenses & Accessories Shown On The Deal Page. Offer Includes Such As Canon, Nikon, Fuji film, Sony, Panasonic & Many More. Discount Varies From Product To Product. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/cameras/pr?sid=jek%2Cp31&affid=vishwajit8&affExtParam1=CAMERAS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Furniture Store – Upto 70% Off On Sofas, Beds, Mattresses & More + No Cost EMI Offers",
        "description": "Get Upto 70% Off On Furniture Products Such as Sofas, Beds, Wardrobes, TV Units, Coffee Tables, Side Tables, Recliners, Mattresses & More. Shop From 10,000+ Brands & 5 Lakh+ Products. Include Brands Like HomeTown, Godrej Interio, Peps, Nilkamal & More. Choose From Various EMI Options At The Time Of Payment. Visit The Offer Page For More Details.",
        "link": "https://dl.flipkart.com/dl/furniture-furniturestudio-store?affid=vishwajit8&affExtParam1=FURNITUREMAIN&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Mobile Accessories – Min 50% Off On SD Cards, Power Banks & More",
        "description": "Mobile Accessories Are Must To Have Thing In Today’s Lifestyle. Flipkart Has Wide Range Of It To Grab At Min 50% Off. Offer Page Includes Options Like – SD Cards, Headsets, Power Banks, Etc From Many Known Brands Such As JBL, SONY, Motorola & More. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/mobile-accessories/pr?sid=tyy%2C4mr&p%5B%5D=facets.discount_range_v1%255B%255D%3D50%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=MOBILEACCESSORIES&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Microwave Oven – Min 20% Off + Exchange & No Cost EMI Offers",
        "description": "Microwave Ovens Are At Minimum 20% Off On Top Brands Like – IFB, Samsung, LG, Onida, Etc. You Can Select The Products As Per Your Requirement In Terms Of Capacity, Features, Power Output & More. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/microwave-ovens/pr?sid=j9e%2Cm38%2Co49&p%5B%5D=facets.discount_range_v1%255B%255D%3D20%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=MICROWAVE&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Printers – Upto 40% Off On Canon, HP, Samsung & More",
        "description": "Now Upto 40% Off On Printers Listed On The Offer Page. Printers Are From Top Brands Like Canon, HP, Samsung & More. Get Extra 10% Off Federal Bank Credit Card Transaction Upto Rs.3000 On Order Of Rs.5000 & Above. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/computers/printers-inks/printers/pr?sid=6bo%2Cffn%2Ct64&affid=vishwajit8&affExtParam1=PRINTERS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Water Purifiers – Upto 70% Off On Kent, Blue Star, Livpure & More + Exchange & No Cost EMI Offer",
        "description": "Get Upto 70% Off  On Water Purifiers Listed On The Offer Page. Choose From Top Brands Like Kent, Blue Star, Livpure and More. RO+UV Gravity Purifiers At Best Price. Click The Link To Grab The Deal.",
        "link": "https://dl.flipkart.com/dl/water-purifiers/pr?sid=j9e%2Cabm%2Ci45&affid=vishwajit8&affExtParam1=WATERPURIFIER&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Personal Care – Upto 70% Off On Trimmers, Dryers, Straightener & More",
        "description": "Get Upto 70% Off On Personal Care Appliances Like Trimmers, Shaver’s, Hair Dryers, Hair Straighteners & More From Brands Like Philips, Nova, Panasonic, Vega and More Displayed On The Deal Page. Discount May Vary From Product To Product. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/health-personal-care-appliances/personal-care-appliances/pr?sid=zlw%2C79s&affid=vishwajit8&affExtParam1=PERSONALCARE&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Speakers – Upto 70% Off On JBL, Sony, Philips, Boat & More",
        "description": "Get Upto 70% Off On Car Speaker, Gaming Speaker, Home Audio Speaker, Laptop & Desktop Speaker, Mobile & Tablet Speaker, Soundbar, Tower Speaker etc. Speakers Are From Top Brand Like JBL, Boat, Sony, Philips & More. Visit The Landing Page To Know More.",
        "link": "https://dl.flipkart.com/dl/audio-video/speakers/pr?sid=0pm%2C0o7&affid=vishwajit8&affExtParam1=SPEAKERS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Home Decor – Upto 80% Off On Showpiece, Decals, Clocks & More",
        "description": "Upto 80% Off On Home Decor Products Such As Showpiece, Decals, Clocks, Paintings, Wall Shelves, Pooja Essentials, Home Lights & More. Checkout The Landing Page For Amazing Deals.",
        "link": "https://dl.flipkart.com/dl/home-decor/pr?sid=arb&affid=vishwajit8&affExtParam1=HOMEDECOR&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Home Furnishing Store – Min 40% Off On Bedsheets, Curtains, Carpets & More",
        "description": "Now Get Min 40% Off On Furnishings Such As Bedsheets, Curtains, Cushion & Pillow Covers, Blankets, Quilts & Dohars, Towels, Kitchen & Dining Linen, Mats & Carpets & More Starting At Rs.99. Choose From Various EMI Options At The Time Of Payment. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/home-furnishing/pr?sid=jra&p%5B%5D=facets.discount_range_v1%255B%255D%3D40%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=HOMEFURNISHING40OFF&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Samsung Mobile – Upto Rs.30,000 Off + Exchange & No Cost EMI Offers",
        "description": "Now Get Upto Rs.30,000 Off On Samsung Mobile Phones. Some Of The Best Mobiles Like Samsung Galaxy A30s, Samsung Galaxy M40, Samsung M10S, Samsung Galaxy A10s, Samsung Galaxy A10s, Samsung Galaxy A50, Samsung Galaxy S9 Plus, Samsung Galaxy A50. Get Extra 10% Off Federal Bank Credit Card Transaction Upto Rs.3000 On Order Of Rs.5000 & Above. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/search?sid=tyy%2C4io&p%5B%5D=facets.brand%5B%5D%3DSamsung&affid=vishwajit8&affExtParam1=SAMSUNG&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Realme Mobiles – Upto Rs.5,000 Off + Exchange & No Cost EMI Offers",
        "description": "Get Upto Rs.5,000 Off On Smartphones. Select From Latest Mobile Models Like Realme Narzo 30 5G, Realme Narzo 30, Realme C25s, Realme X7 Max, Realme 8 5G, Realme RMX3231 & More. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/mobiles/realme~brand/pr?sid=tyy%2C4io&affid=vishwajit8&affExtParam1=REALME&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Xiaomi Mobiles – Upto Rs.3,000 Off + Exchange & No Cost EMI Offers",
        "description": "Get Upto Rs.3,000 Off On Xiaomi Smartphones. Select From Redmi Note 10, Redmi Note 10 Pro, Redmi Note 10S, Redmi Note 9, Redmi Note 9 Pro, Mi 11X, Mi 10i, Mi 10T Series And Many More Latest Phones. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/mobiles/mi~brand/pr?sid=tyy%2C4io&affid=vishwajit8&affExtParam1=XIAOMI&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "POCO Mobiles – Upto Rs.7000 Off + Exchange & EMI Offers",
        "description": "Shop For Poco Smartphones From Flipkart And Get Upto Rs.7000 Off. Shop For Different Models Such As  Poco M3, Poco C3. Poco M2, Poco X3 Pro, Poco C3 And Much More. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/mobiles/poco~brand/pr?sid=tyy%2C4io&affid=vishwajit8&affExtParam1=POCOMAIN&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Apple MacBook – Upto Rs.15,000 Off + Upto Rs.10,000 HDFC Bank Off + Exchange & EMI Offers",
        "description": "Get Upto Rs.15,000 Off On Apple MacBook Shown On The Offer Page. Also, Get Extra Upto Rs.10,000 Off On HDFC Bank Cards Transactions. Offer Applicable On Selected Products. Also, Avail Of Exchange & EMI Offers On Select Products. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/q/macbook?affid=vishwajit8&affExtParam1=MACBOOK&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Apple Smart Watches – Starting At Rs.20,900 Only + EMI Offers",
        "description": "Get Apple Smart Watches Starting From Rs.20,900 Listed On The Offer Page. No Coupon Code Is Required. Get Extra 10% Off Federal Bank Credit Card Transaction Upto Rs.3000 On Order Of Rs.5000 & Above. EMI Offers Are Also Available. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/wearable-smart-devices/smart-watches/apple~brand/pr?sid=ajy%2Cbuh&p%5B%5D=facets.availability%255B%255D%3DExclude%2BOut%2Bof%2BStock&affid=vishwajit8&affExtParam1=APPLEWATCH&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Apple Airpods – Upto Rs.3000‬ Off On Airpods",
        "description": "Get Upto Rs.3,000‬ Off On Airpods Shown On The Offer Page. Discount May Vary From Product To Product. EMI Offers Also Available On Selected Products. Visit the landing Page To Get the Deals.",
        "link": "https://dl.flipkart.com/dl/q/airpods?p%5B%5D=facets.availability%255B%255D%3DExclude%2BOut%2Bof%2BStock&affid=vishwajit8&affExtParam1=APPLEAIRPODS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Power Banks – Min 30% Off On Power Banks From MI, Philips & More",
        "description": "Get Minimum 30% Off Branded Power Banks Listed On The Offer Page. Collection Include Brands Like Xiaomi, Syska, Honor, Lenovo & More. Exchange & No Cost EMI Offers Are Also Available. No Cost EMI Also Available. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/mobile-accessories/power-banks/pr?sid=tyy%2C4mr%2Cfu6&p%5B%5D=facets.discount_range_v1%255B%255D%3D30%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=POWERBANK&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Vacuum Cleaners – Upto 70% Off On Top Brands + No Cost EMI Offers",
        "description": "Now Avail Upto 70% Off On Vacuum Cleaners From Top Brands As Shown On The Offer Page. Includes Brands Like Dyson, Karcher, Inalsa Black & Decker & More. No Cost EMI Available On Select Products. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/vacuum-cleaners/pr?sid=j9e%2Cabm%2Cul2&affid=vishwajit8&affExtParam1=VACUUMCLEANERS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Moto Mobiles – Upto Rs.11,000 Off + Exchange & No Cost EMI Offers",
        "description": "Now Get Upto Rs.11,000 Off On Motorola Mobiles Phones Shown On The Deal Page. Offer Includes Models Such As Motorola One Power, Moto Z2 Play, Moto E5 Plus, Moto G6 Play, Moto X4, G5 Plus, Moto Z, E4 Plus & More. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/motorola-mobile-phones-store?affid=vishwajit8&affExtParam1=MOTO&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Oppo Mobiles – Upto Rs.12,000 Off + Exchange & No Cost EMI Offers",
        "description": "Now Get Upto Rs.12,000 Off On Best Selling Oppo Mobile Phones. Get Offers On Oppo F9 & F9 Pro, OPPO A71k, OPPO A3s, OPPO A5 And Other Oppo Mobiles. No Coupon Code Required To Grab This Offer. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/mobiles/oppo~brand/pr?sid=tyy%2C4io&affid=vishwajit8&affExtParam1=OPPO&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Vivo Mobiles – Upto Rs.8,000 Off + Exchange & No Cost EMI",
        "description": "Get Upto Rs.8,000 Off On Best Selling Vivo Mobile Phones Such as Vivo X80 Pro, Vivo X80, Vivo V23, Vivo V23e, Vivo V11 & V11 Pro, V9, V9 Pro,  V5S, V7, V7 Plus, and More. Get Extra 10% Off Federal Bank Credit Card Transaction Upto Rs.3000 On Order Of Rs.5000 & Above. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/mobiles/pr?sid=tyy%2C4io&p%5B%5D=facets.brand%5B%5D%3DVivo&affid=vishwajit8&affExtParam1=VIVO&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Air Coolers – Upto 60% Off On Bajaj, Voltas & More",
        "description": "Avail Upto 60% Off On Air Coolers. Choose From Brands Like Bajaj, Symphony, Voltas, Kenstar, Crompton, Etc. Capacity Of Lined Up Products Varies From 10 Litres To 60 Litres. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/air-coolers/pr?sid=j9e%2Cabm%2C52j&affid=vishwajit8&affExtParam1=AIRCOOLER&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Fans – Upto 60% Off On Ceiling, Table, Pedestal Fan & More + No Cost EMI Offers",
        "description": "Get Upto 60% Off On Ceiling Fan, Exhaust, Pedestal, Table, Tower, Wall etc. Fans Are From To Brand Like Crompton, Havells, Usha, Orient, Bajaj, Orpat & More. Checkout The Landing Page To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/fans/pr?sid=j9e%2Cabm%2Clbz&affid=vishwajit8&affExtParam1=FANS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Tablets Store – Upto 40% Off On Lenovo, Samsung & More + No Cost EMI Offers",
        "description": "Get Upto 40% Off On Branded Tablets Listed On The Offer Page. Offer Valid On Brands Like Lenovo, Samsung & More. Click The Link To Grab The Deal.",
        "link": "https://dl.flipkart.com/dl/tablets/pr?sid=tyy%2Chry&affid=vishwajit8&affExtParam1=TABLET&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Nokia Mobiles – Upto Rs.6,000 Off + Exchange & No Cost EMI Offers",
        "description": "Now Get Upto Rs.6,000 Off On Nokia Mobiles At Flipkart. Check The Latest Series Of Nokia Mobile Phones -Nokia 2.3, Nokia 8.2, Nokia 5.2, Nokia 9, Nokia 7.2, Nokia 8.1, Nokia 7.1 Plus, Nokia 5.1 Plus, Nokia 5.1 & More. Choose From Various EMI Options At The Time Of Payment. Visit The Landing Page To Avail The Offer.",
        "link": "https://dl.flipkart.com/dl/mobiles/pr?sid=tyy%2C4io&p%5B%5D=facets.brand%255B%255D%3DNokia&affid=vishwajit8&affExtParam1=NOKIA&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Baby Care – Min 30% Off On Diapers, Baby Food & More",
        "description": "Avail Min 30% Off On Baby Care Essentials. Shop For Diapers, Baby Food, Feeding Bottles & More. Offer Includes Various Brands Like MamyPoko, Himalaya, Mamaearth, Johnsons, Huggies & Others. Discount May Vary From Product To Product. Also Shop For Categories Such As T-Shirts, Shirt, Tops. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/baby-care/pr?sid=kyh&p%5B%5D=facets.discount_range_v1%255B%255D%3D30%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=BABYCAREMIN30&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Books Store – Upto 70% Off On Fictional, Non-Fictional, Educational Books & More",
        "description": "Get Upto 70% Off On Books Like Educational & Professional Books, Fiction & Non-Fiction Books, Reference Books, Indian Writing Books, Self-Help Books, Hobbies & Interests Books, Families & Relationships Books, Religion & Spirituality Books, Philosophy Books & More At Flipkart Books Store. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/books-store?affid=vishwajit8&affExtParam1=BOOKS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Stationery Store – Upto 80% Off On School & Office Supplies",
        "description": "Now Shop For Writing Instruments, Desk Organizers, Diaries & Notebooks And Get Upto 80% Off. No Coupon Code Required. Checkout The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/the-stationery-store?affid=vishwajit8&affExtParam1=STATIONERY&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Sports Products – Upto 70% Off On Wide Range Of Products",
        "description": "Get Upto 70% Off On Sports Products Displayed On the Catalogue Page. Discount May Vary From Product To Product. Products Like Badminton, Football, Cricket, Camping, Hiking, Cycling & More Available. Visit The Landing Page To Avail The Offer.",
        "link": "https://dl.flipkart.com/dl/sports/pr?sid=abc&affid=vishwajit8&affExtParam1=SPORTSPRODUCTS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Exercise & Fitness – Upto 80% Off On Gym & Yoga Equipment’s",
        "description": "Now Get Upto 80% Off On Fitness Accessories, Fitness Equipment, Yoga, Mobility Aids & Equipment’s. Click On The Link To Know More Details.",
        "link": "https://dl.flipkart.com/dl/all/exercise-fitness/~cs-h5zico9kk3/pr?sid=all%2Cqoc&affid=vishwajit8&affExtParam1=GYM&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Mobiles Phones Under Rs.7000 + Exchange & No Cost EMI Offers",
        "description": "Now Get Mobiles Phones Under Rs.7000 Shown On The Page Includes Smartphones & Featured Phones. Exchange & No Cost EMI Offers Also Available. Checkout The Landing Page To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/mobiles/pr?sid=tyy%2C4io&p%5B%5D=facets.price_range.to%3D7000&sort=popularity&affid=vishwajit8&affExtParam1=MOBILEUNDE7K&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Small Home Appliances – Upto 70% Off On Irons, Water Purifiers & More + No Cost EMI Offers",
        "description": "Get Upto 70% Off On Small Home Appliances Such As  Irons, Water Purifiers, Fans, Air Coolers, Inverters, Vacuum Cleaners.  Sewing Machines,  Voltage Stabilizers, Water Geysers, Immersion Rods & More. Small Appliances Are From Top Brands Like Philips, Bajaj, LG, Whirlpool, Maharaja Whiteline, Usha & More. Also, Avail No Cost EMI Offer.",
        "link": "https://dl.flipkart.com/dl/home-appliance-store?affid=vishwajit8&affExtParam1=SMALLAPPLIANCES&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Computer Accessories Store – Upto 70% Off On Laptop & Computer Accessories",
        "description": "Now Get Upto 70% Off On Laptop & Computer Accessories Such As Pen Drives, External Hard Disks, Keyboards, Mouse, Cables, Headphones, Routers & More. Offer Includes Brands Such As Sandisk, Seagate, Transcend, Philips, D-Link, Sony & Many More. No Promo Code Required. Visit The Offer Page To Get The Offer.",
        "link": "https://dl.flipkart.com/dl/computer-accessories-store?affid=vishwajit8&affExtParam1=COMPUTERACC&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Storage Devices – Upto 70% Off On Hard Disks, Pen Drives & More",
        "description": "Get Upto 70% Off On Storage Device Like Internal & External Hard Disks, Pen Drives etc. At Flipkart & Get Sandisk, Sony, Hp & More As Listed On The Offer Page. Click the link to grab the deal.",
        "link": "https://dl.flipkart.com/dl/computers/storage/pr?sid=6bo%2Cjdy&affid=vishwajit8&affExtParam1=DATASTORAGE&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Sunglasses – Flat 30% To 80% Off On Fastrack, RayBan & More",
        "description": "Get Flat 30% To 80%  Off O n Wide Range Of Sunglasses For Men & Women Both Displayed On the Offer Page. Offer Includes Brands Like Fastrack, Ray-Ban, Tommy Hilfiger, Joe Black, MTV, Image & More. Offer Valid Once Per Card. Visit The Landing  Page For More Details.",
        "link": "https://dl.flipkart.com/dl/sunglasses/pr?sid=26x&p%5B%5D=facets.discount_range_v1%5B%5D%3D30%25+or+More&affid=vishwajit8&affExtParam1=SUNGLASS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Jewellery – Upto 90% Off On Rings, Bangles, Jewellery Sets & More",
        "description": "Get Upto 90% Off On Jewellery Such As Rings, Bangles, Jewellery Sets, Necklaces & More.No Coupon Code Required To Avail This Offer. Visit The Landing Page To Avail The Offer.",
        "link": "https://dl.flipkart.com/dl/jewellery/pr?sid=mcr&affid=vishwajit8&affExtParam1=JEWELLERY&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Asus Mobiles – Upto 30% Off + Exchange & No Cost EMI Offers",
        "description": "Now Explore & Buy Upto 30% Off On Asus Mobile Phones. Offer Includes Models Such As Asus Zenfone Max Pro M1, Asus ZenFone Lite L1, Asus Zenfone Max & More. Get Upto Rs.17,500 Off On Old Phone Exchange. No Cost EMI Also Available. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/mobiles/pr?sid=tyy%2C4io&p%5B%5D=facets.brand%255B%255D%3DAsus&affid=vishwajit8&affExtParam1=ASUS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Kids Clothing – Min 40% Off On Boys Wear & Girls Wear",
        "description": "Avail Minimum 40% Off On Kids Clothing Shown On The Offer Page. Buy Shirts, Tops, Tunic, Shorts, Leggings & Much More From Top Brands Such As Allen Solly, USPA, UCB, Puma, Flying Machine etc. No Need Of Any Coupon Code, Products are at its best price. Visit the Landing Page For More.",
        "link": "https://dl.flipkart.com/dl/clothing-and-accessories/pr?sid=clo&otracker=categorytree&p%5B%5D=facets.discount_range_v1%255B%255D%3D30%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=KIDSCLOTHING&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Women Clothing – Min 40% To 80% Off On Ethnic, Western, Formal & More",
        "description": "Get Min 40% To 80% Off On Ethnic Wear, Western Wear, Lingerie, Sleep & Swimwear, Fusion Wear, Formal Wear & More. Shown In The Catalog. Brands Like Aurelia, W For Woman, Vero Moda, AND, Benetton etc.  Products Are Already Discounted. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/womens-clothing/pr?sid=2oq%2Cc1r&p%5B%5D=facets.discount_range_v1%5B%5D%3D40%25+or+more&affid=vishwajit8&affExtParam1=WCLOTHING&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Women Footwear – Min 30% To 70% Off On Puma, Nike, Adidas & More",
        "description": "Get Minimum 30% To 70% Off On Top Brands Of Women Footwear Such As Puma, Nike, Adidas, Lotto, Catwalk, Fila, Reebok, Benetton & Many More Displayed On The Offer Page. Avail Offers On Sports Shoes, Formal Shoes, Casual Shoes, Boots, Flip Flops, Sandals, Slippers and More.",
        "link": "https://dl.flipkart.com/dl/search?p%5B%5D=facets.discount_range_v1%5B%5D%3D30%25+or+more&sid=osp%2Fiko&affid=vishwajit8&affExtParam1=WFOOTWEAR&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Men’s Clothing – Min 30% – 80% Off On Shirts, Jeans, Trousers & More",
        "description": "Get Minimum 30% To 80% Off On Men Clothing Products Listed On The Offer Page. Final Price Will Be Seen At Checkout Page. It Includes top brands Like Levis, Jack & Jones, Wrangler, Lee, Reebok, Puma, Benetton, Arrow & More Displayed On The Offer Page. Visit The Landing Page For More Details.",
        "link": "https://dl.flipkart.com/dl/mens-clothing/pr?sid=2oq%2Cs9b&p%5B%5D=facets.discount_range_v1%255B%255D%3D30%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=MENFCLOTHING&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Men’s Footwear – Min 30% To 80% Off On Shoes, Sandals, Floaters, Slippers, Flip Flops & More",
        "description": "Get Minimum 30% To 80% Off On  Men’s Footwear Displayed On The Offer Page. Shop From Sports Shoes, Formal Shoes, Casual Shoes, Boots, Flip Flops, Sandals, Slippers and More. From The Brands Such As Puma, Nike, Adidas, Lotto, Catwalk, Fila, Reebok, Benetton & Many More. Click On The Link To Grab The Offer.",
        "link": "https://dl.flipkart.com/dl/mens-footwear/pr?sid=osp%2Ccil&p%5B%5D=facets.discount_range_v1%255B%255D%3D30%2525%2Bor%2Bmore&affid=vishwajit8&affExtParam1=MENSFOOTWEAR&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Fragrances – Min 30% To 70% Off On Deodorants & Perfumes",
        "description": "Now Get Minimum 30% To 70% Off  On Deodorants & Perfumes. Offers Includes Products From Top Brands Like Boss, Calvin Klein, Davidoff, Dolce & Gabbana, Victoria’s Secret and More Shown On The Offer Page. Discount May Vary From Product To Product.Visit the Landing Page for More Details.",
        "link": "https://dl.flipkart.com/dl/beauty-and-grooming/fragrances/pr?p%5B%5D=facets.discount_range_v1%5B%5D%3D30%25+or+more&sid=g9b%2C0yh&affid=vishwajit8&affExtParam1=FRAGRANCE&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Car & Bikes – Upto 80% Off On Car & Bikes Accessories",
        "description": "Now Get Upto 80% Off On Car & Bikes Accessories Such As Helmets, Rider Gloves, Car Seat Covers, Car Perfumes, Car Cleaners, and Many More Shown On The Offer Page. Discount May Vary From Product To Product.",
        "link": "https://dl.flipkart.com/dl/automotive/car-bike-accessories/pr?sid=0hx%2Cbwd&p%5B%5D=facets.availability%255B%255D%3DExclude%2BOut%2Bof%2BStoc&affid=vishwajit8&affExtParam1=CARANDBIKE&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Adidas Footwear – Min 40% Off On Footwear For Men, Women & Kids",
        "description": "Get Min 40% Off On Adidas Footwear For Men, Women & Kids Listed On The Offer. No Promo Code Required. Visit The Offer Page To Get The Offer.",
        "link": "https://dl.flipkart.com/dl/footwear/adidas~brand/pr?sid=osp&p%5B%5D=facets.serviceability%5B%5D%3Dtrue&affid=vishwajit8&affExtParam1=ADIDAS&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "Puma – Flat 20% To 60% Off On Footwear, Clothing, Bags & More",
        "description": "Get Flat 20% – 60% Off On All Puma Products Shown On The Catalog Page. Offer Includes Both Men & Women Fashion Products Like Clothing, Footwear, Accessories & Many More. Products Are Already At Best Price. Visit Landing Page to Get the Offer.",
        "link": "https://dl.flipkart.com/dl/all/puma~brand/pr?p%5B%5D=facets.discount_range%255B%255D%3DMore%2Bthan%2B50%2525&sid=all&affid=vishwajit8&affExtParam1=PUMA&tag=offerscodes-21",
        "merchant": "flipkart"
    },
    {
        "title": "MarQ Air Conditioners – Upto 40% Off on Split AC & Window AC",
        "description": "Now Get Upto 40% Off On MarQ Air Conditioners Listed On The Offer Page. Offer Page Includes  Various Capacity Of The AC . Choose From Various EMI Options At The Time Of Payment. Checkout The Landing Page Amazing Deals.",
        "link": "https://dl.flipkart.com/dl/air-conditioners/pr?sid=j9e%2Cabm%2Cc54&q=marq+ac&affid=vishwajit8&affExtParam1=MARQAC&tag=offerscodes-21",
        "merchant": "flipkart"
    }
]