[{"title": "Fab Phones Fest – Upto 40% Off + Upto Rs.5,000 Bank Off + No Cost EMI & Exchange", "description": "Get Upto 40% Off On Top Selling Mobiles & Accessories Shown On The Offer Page. Shop From Brands Like Xiaomi, Samsung, OnePlus, & More. Get Upto Rs.5,000 Off On Selected Bank Cards Transactions. Check The Product Page For Details. Also Avail Up to Rs.15000 Off By Exchanging Your Old Smartphone. Visit Landing Page To Know More.", "link": "https://amzn.to/2KW6xML?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "The Electronics Store – Upto 75% Off + Extra 10% Bank Off On Laptops, Cameras & More", "description": "Get Up To 75% Off On A Wide Range Of Best Selling Electronics Listed On The Offer Page. Includes Various Categories Such As Laptops, Tablets, Cameras, Headphones, Printers, Smartwatches & More. Also Get Extra 10% Off On AU Bank OR Yes Bank Credit Card Transactions. For AU Bank, Minimum Purchase Of Rs.5,000 Required & For Yes Bank Minimum Purchase Of Rs.10,000 Required. Maximum Discount Of Rs.1,500 Can Be Availed. Visit Landing Page To Know More.", "link": "https://amzn.to/3tVBPXU?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": null, "description": null, "link": null, "merchant": "amazon"}, {"title": "End Of Season Sale – Upto 70% Off On Clothing, Footwear & More", "description": "Get Upto 70% Off On Fashion Products Likes Clothing, Footwear, Accessories & More From Top Brands Such As UCB, USPA, Tommy Hilfiger, Levis, Puma, Adidas, Woodland, Biba, Vero Moda, Etc Only On Amazon. Visit The Landing Page To Know More.", "link": "https://amzn.to/3J0Gkao?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Winter Essentials – Upto 50% Off On Winter Appliances + No Cost EMI", "description": "Now Avail Upto 50% Off On Winter Essential Appliances On Amazon. Shop For Water Heaters, Air Purifiers, Kettles & More. Also Avail No Cost EMI And Exchange Offers On Selected Products. Visit Landing Page To Know More.", "link": "https://amzn.to/3fJRDtz?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Laptop Store – Upto Rs.40,000 Off + Extra 10% Bank Off + Exchange & No Cost EMI", "description": "Get Upto Rs.40,000 Off On Laptops Shown On The Offer Page. Choose from brands like Apple Macbooks, Lenovo, Dell, HP, Acer, Asus, iBall, etc. Also Get Extra 10% Off On AU Bank OR Yes Bank Credit Card Transactions. For AU Bank, Minimum Purchase Of Rs.5,000 Required & For Yes Bank Minimum Purchase Of Rs.10,000 Required. Maximum Discount Of Rs.1,500 Can Be Availed. Visit Landing Page To Know More.", "link": "https://amzn.to/3KppClP?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Home & Kitchen Store – Upto 70% Off On Usha, Bajaj, Pigeon & More", "description": "Now Get Upto 70% Off On A Wide Range Of Home & Kitchen Appliances Starting From Rs.99 Only. Shop From Top Brands Like Usha, Bajaj, Pigeon, Philips & More. Visit Landing Page To Know More.", "link": "https://amzn.to/3bUQGMP?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Headphones – Min 25%-80% Off On Boat, Sony, JBL, Mivi & More", "description": "Now Get Minimum 25% – 80% Off On Headphones From Top Brands Such As JBL, Sony, Boat, Philips, Mivi, MI, Sennheiser & Many More Shown On The Offer Page. Discount May Vary From Product To Product. Click For Amazing Deals. For AU Bank Credit & Debit Card Maximum Discount Of Rs.1500 Can Be Availed. Visit Landing Page To Know More.", "link": "https://amzn.to/3Sii2g2?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Smart Watches – Flat 25% To 60% Off On Noise, BoAt, Apple & More", "description": "Explore Smart Watches & Accessories Collection & Avail Flat 25% to 60% Discount. Offer Page Includes Watches From Brands Like Fossil, Samsung, Go Noise & More. Visit Landing Page To Know More.", "link": "https://amzn.to/3PCg8Fw?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Business Value Days – Upto 70% Off Deals + Extra 10% Cashback Upto Rs.500", "description": "Now Shop From Amazon Business Value Days And Get Upto 70% Off On Computer, Accessories, Electronics & More. Also Get Extra 10% Cashback On Using The Given Code. Minimum Transaction Of Rs.3,500 Required, Maximum Cashback Of Rs.500 Can Be Availed. Offer Valid Only Only For First Two Users Of Business Account & Only On Prepaid Orders. Visit The Landing Page For More Details.", "link": "https://amzn.to/3FOmVYV?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Television Store – Upto 50% Off + Extra 10% Bank Off + No Cost EMI & Exchange", "description": "Now Get Upto 50% Off On Televisions Shown On Offer Page From Brands like Xiaomi, Samsung, OnePlus, LG, TCL, Sanyo, Sony & More. Also Get Extra 10% Off On AU Bank OR Yes Bank Credit Card Transactions. For AU Bank, Minimum Purchase Of Rs.5,000 Required & For Yes Bank Minimum Purchase Of Rs.10,000 Required. Maximum Discount Of Rs.1,500 Can Be Availed. With Exchange Save Upto Rs.5,500. Also Avail No Cost EMI Offers. Visit Landing Page To Know More.", "link": "https://amzn.to/3oyHi4e?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Refrigerator Store – Upto Rs.35,000 Off + Exchange & No Cost EMI", "description": "Now Get Upto Rs.35,000 Off On Refrigerators Shown On Catalog Page. Brands Like Samsung, LG, Whirlpool, Videocon & Many More Available. Visit Landing Page To Know More.", "link": "https://amzn.to/3oBH8t6?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Air Conditioners – Upto 40% Off On Voltas, Kenstar & More Brands + No Cost EMI", "description": "Now Get Up To 40% Off On Air Conditioners. Products Include Brands Like Voltas, Carrier, Kenstar, Hitachi, And More. Visit Landing Page To Know More.", "link": "https://amzn.to/3cNFCkE?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Washing Machines – Upto Rs.13,000 Off On IFB, Whirlpool & More Brands + No Cost EMI", "description": "Now Get Upto Rs.13,000 Off On Washing Machines From Brands Such As Samsung, IFB, Whirlpool, LG, Haier, Onida & Many More Shown On Catalogue Page. Visit Landing Page To Know More.", "link": "https://amzn.to/3JhXpgi?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "OnePlus – Upto Rs.15,000 Off + Extra 10% AU Bank Off + Exchange & No-Cost EMI", "description": "Get Upto 30% Off On OnePlus Mobiles, TVs & Accessories. Also, Shop From Televisions & Accessories Listed On Offer Page. Shop For Oneplus 10T, 10 Pro 5G, 10R 5G, 9 Series (9RT 5G, 9 Pro 5G & 9 5G), Nord Series (Nord CE, Nord 2, Nord CE 2) & More. Also Get Extra 10% Off On AU Bank Credit Card Non-EMI Transactions. Minimum Purchase Of Rs.5,000 Required, Maximum Discount Of Rs.1,000 Can Be Availed.  Discount Amount Varies From Product To Product. Visit Landing Page To Know More.", "link": "https://amzn.to/3PNiFwU?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Furniture – Upto 75% Off On Tables, Beds, Sofas & More + No Cost EMI", "description": "Now Get Upto 75% Off On Wide Range Of Furniture Products-Such As Stylish Beds, Sofas & Couches, Pouffes & Ottomans, Bean Bags, T.V. & Entertainment Units, Recliners, Bookshelves, Sofa Sets, Tables, Wall Shelves, Cabinets & More. Visit Landing Page To Know More.", "link": "https://amzn.to/3PZvweY?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Clothing Store – Flat 30% To 70% Off On Men, Women & Kid’s Clothing", "description": "Now Get Flat 30% To 70% Discount On Men’s, Women’s & Kid’s Clothing. Explore Top Clothing Stores Such As Levis, Aurelia, Only, Jack & Jones, And More. Visit Landing Page To Know More.", "link": "https://amzn.to/3vnZAZX?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Footwear – Flat 30% To 70% Off On Nike, Puma & More Brands", "description": "Now Get Flat 30% To 70% Off On Footwear For Men, Women, and Kids From Top Brands Such As Puma, Adidas, Reebok, Nike, Fila, Skechers, Lotto & Many More Shown On The Offer Page. Visit The Landing Page To Grab The Offer.", "link": "https://amzn.to/3q67Dpp?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Watches – Flat 25% To 75% Off On Fastrack, Fossil, Timex & More", "description": "Get Flat 25% To 75% Off On Watches For Men, Women, And Kids From All Top Brands. Offer Includes Brands Such As Titan, Fossil, Tommy Hilfiger, Guess, Fastrack & Many More. Check Out The Offer Page For More Details.", "link": "https://amzn.to/39xxDE4?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Beauty – Upto 70% Off On Top Beauty & Makeup Brands", "description": "Now Get Upto 70% Off On Top Beauty, Makeup, and Skin Care Brands Starting At Rs.99 Only. Offer Page Includes Loreal, Lakme, Ponds, Nivea, Maybelline, Garnier, Dove & Many More. Visit Landing Page To Know More.", "link": "https://amzn.to/3GCp2kO?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Apple Store – Upto 35% Off + Upto Rs.10,000 HDFC Off + Exchange & No Cost EMI", "description": "Now Get Upto 35% Off On Apple Products On Amazon. Shop For iPhones, iPad, Macbooks, Accessories & More. Also, Get Extra Upto Rs.10,000 Off On HDFC Bank Cards Transactions. Offer Applicable On Selected Products. Also, Get Exchange Offers & No-Cost EMI On Select Products. Visit The Landing Page To Know More.", "link": "https://amzn.to/3dFIBvV?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Photography Store – Upto 60% Off On Cameras & Acccessories + No-Cost EMI Offers", "description": "Avail Upto 60% Off On DSLRs, Digital Cameras & Accessories as shown on the offer page. Available On Brands Like Nikon, Canon, Samsung, Sony, And More. Offer Includes Cameras, Lenses, Batteries & Chargers Etc. Visit Landing Page To Know More.", "link": "https://amzn.to/3PIVP9B?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Printers & Accessories – Upto 50% Off On HP, Canon & More Brands + No Cost EMI", "description": "Avail Upto 50% Off On Top Brands Printers & Ink Includes Brands Like Samsung, Canon, HP, Brother, Epson & More. Visit Landing Page To Know More.", "link": "https://amzn.to/3cJ9A9v?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Amazon Devices – Upto Rs.6000 On Echo, Kindle & Firestick", "description": "Now Get Upto Rs.6000 OFF On Echo, Kindle & Firestick Shown On The Offer Page. No Coupon Code required To Grab This Offer. Visit Landing Page To Know More.", "link": "https://amzn.to/3PCvsSB?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Kitchen Appliances – Upto 70% Off On Toasters, Cooktops & More", "description": "Avail Upto 70% Off On Kitchen Appliances Like Toasters, Electric Kettles, Induction Cooktops, Juicers & More. Visit Landing Page To Know More.", "link": "https://amzn.to/3zbtaCW?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Jewellery – Flat 25% To 80% Off On Earrings, Necklace & More", "description": "Now Get Flat 25% To 80% Off On Jewellery Collection Shown On The Catalog Page. Offer Includes Major Brands Such As Zaveri, Sukkhi, YouBella, Karatcart, Shining Diva & Many More. Shop For Earrings, Necklaces, Rings, Bracelets, Nose Rings & More. Check Out The Landing Page To Grab The Offer.", "link": "https://amzn.to/3HngzSY?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Amazon Pantry – Upto 50% Off On Grocery & Fresh + Extra 10% BOB Off + Upto Rs.100 CB", "description": "Now Get Upto 50% Off On Grocery & Fresh Products. Shop From Cooking Essentials, Fruits & Vegetables, Food & Beverages, Snacks & Beverages, Packaged Foods, Personal Care Products & More. Get Extra 10% Off On Bank Of Baroda Bank Credit Cards Non-EMI Transaction. Minimum Order Of Rs.2000 Required, Maximum Dicount Of Rs.300 Can Be Availed. Offer Valid Only On Tuesdays. Also Get Upto Rs.100 Cashback On First Order Of Minimum Rs.500 & More. Cashback Will Be Credited In Amazon Pay Balance. Check Out Offer Page To Collect The Coupon. Visit Landing Page To Know More.", "link": "https://amzn.to/3BP03s7?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Xiaomi Mobiles – Upto 25% Off + Upto Rs.5,000 ICICI Off + Exchange & No Cost EMI", "description": "Get Upto Rs.5,000 Off On Xiaomi Smartphones At Amazon. Choose From Latest Xiaomi Smartphones Like Redmi Note 11T, Note 10S, Note 9, Note 9 Pro, 9A, Redmi Note 10, Note 10 Pro, Mi 11X, Mi 10i, Mi 10T Series & Much More. Also Get Extra Upto Rs.5,000 Off On ICICI Bank Credit Card (EMI + Non-EMI) OR Debit Card (EMI) Transactions. Offer Valid On Selected Smartphone Models. Check Product Page For Details. Visit Landing Page To Know More.", "link": "https://amzn.to/3HlsnVI?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Xiaomi Notebook – Upto 25% Off + Exchange & No Cost EMI Offer", "description": "Get Upto 25% Off On Mi & Redmi Laptops Listed On The Offer Page. Select From Mi Notebook 14 Intel core i3, Mi Notebook 14 Intel Core i5, Mi Notebook Horizon Edition 14 Intel Core i7 & More. Get Extra Upto Rs.18000 Off On Exchange. Also, Avail No Cost EMI Offer With This Product.", "link": "https://amzn.to/3Jcx3vS?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Baby Products – Upto 60% Off On Diapers, Health Care, Gear Accessories", "description": "Get Upto 60% Off On All Baby Products With Products Starting At Rs.199 Only. Offer Includes On Clothing, Footwear, Diapers, Baby Care Products, Toys, Strollers, Prams, Apparels, Footwear And more. Visit Landing Page To Know More.", "link": "https://amzn.to/3oFeSWs?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Whey Protein – Upto 75% Off On Top Brands Supplements & Proteins", "description": "Get Upto 75% Off On Whey Protein Products As Listed On The Offer Page At Amazon. Whey Protein Are From Top Brands Like Optimum Nutrition, Ultimate Nutrition Ultimate, Nutrition, MuscleTech, MuscleBlaze, Optimum Nutrition, Bigmuscles, Isopure, Nature’s Bounty & More. Visit Landing Page To Know More.", "link": "https://amzn.to/3CIiWxd?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Budget Deals – Home & Kitchen Products Starting From Only Rs.99", "description": "Shop For Wide Range Of Products From Home & Kitchen Store Starting At Only Rs.99 On Amazon.  Select From Home Decor, Kitchen & Dining, Garden & Outdoor, Furniture, Sports & Much More. Click On The Link To Know More.", "link": "https://amzn.to/3SHCjvh?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Hot Deals – Upto 80% Off Mobiles, Electronics, Beauty, Fashion & More", "description": "Checkout Hot Deals & Avail Upto 80% Off Mobiles, Electronics, Beauty, Fashion & More Only On Amazon. Click On The Link To Avail Of The Offers.", "link": "https://amzn.to/3RhoMd2?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Amazon Coupons – Upto 80% Extra Off Best Coupons For Today", "description": "Amazon releases new coupons every day on specific products and categories. They announce coupons for electronics, fashion, home & kitchen, books, groceries and more. Get Upto 80% Off Coupons. Check out all Coupons for today at the offer page. Just select the offer in which you are interested in and click on the Collect Coupon button, the coupon will be automatically applied at the time of payment. Also Get Free Shipping For All Prime Users. Check the landing page of this offer for more details.", "link": "https://amzn.to/3S8jmCk?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Backpacks – Min 50% Off On Skybags, Safari, American Tourister & More", "description": "Shop For Backpacks At Amazon & Get Min 50% Off On Skybags, Safari, American Tourister & More Top Brands. Visit Landing Page To Know More.", "link": "https://amzn.to/3oTWc5v?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Mobile Accessories Store – Upto 70% Off On Chargers, Power Banks & More", "description": "Now Get Upto 70% Off On Mobile Accessories Starting From Rs.79 Only At Amazon. Offer Includes Such As Power Banks, Covers, Head Phones, Screen Protector & Many More Shown On The Deal Page. Visit Landing Page To Know More.", "link": "https://amzn.to/3cBADn4?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Power Banks – Upto 65% Off On Intex, Redmi & More Brands + No Cost EMI", "description": "Get Upto 65% Off Power Banks Starting From Rs.949 Onwards Shown On The Offer Page. Offer Include Brands Such As Intex, Lenovo, Redmi, Ambrane, Motorola & Many More. Also Get No Cost EMI From Top Banks. Visit Landing Page To Know More.", "link": "https://amzn.to/3dwrLju?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Recharges & Bill Payments – Upto Rs.500 Amazon Cashback + Earn Extra Rewards", "description": "Now Get Upto Rs.500 Cashback On Recharges & Bill Payment Done Through Amazon. Recharge For Your Phone Or Pay Electric Bill, Gas Bill Or More. Also Earn Extra Rewards. Click On The Link To Know More.", "link": "https://amzn.to/3cKIJdx?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Water Purifiers – Upto 70% Off + No Cost EMI & Exchange Offers", "description": "Now Avail Upto 70% Off On Water Purifiers & Accessories At Amazon. Brands include Kent, Pure, Eureka Forbes, HUL, etc. With Best Price Deals On RO+Uv Ad Gravity Based Purifiers for Ground, Municipal & Multiple Water Sources. Discount May Vary From Product To Product. Visit The Landing Page To Avail The Offer Now.", "link": "https://amzn.to/3OGuzXJ?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Microwave Store – Upto 60% Off On Morphy Richards, LG & More Brands + No Cost EMI", "description": "Now Save Upto 60% On Branded Microwave. Popular Brands Associated In This Offer Are IFB, Samsung, LG, Bajaj, Whirlpool, Godrej, Morphy Richards & Many More. Visit Landing Page To Know More.", "link": "https://amzn.to/3OI9kVE?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Join Amazon Prime At Just Rs.459/3 Months | Rs.1,499/Year", "description": "Now Join Amazon Prime For Free Fast Delivery, Free Movies & More At Just Rs.459 For 3 Months OR Rs.1,499 For An Year. You Can Also Get 30 Days Free Trial. Get Free Delivery, Exclusive Deals, And Many More Perks. Check Out The Offer Page For More Details.", "link": "https://www.amazon.in/tryprime?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Lightning Deals – Upto 75% Off On New Super Saver Deals Every Hour", "description": "Now Get Upto 75% Off Daily New Deals On Mobiles, Electronics, Shoes, Watches, Books, Home & Kitchen Products, Beauty Products and Much More. The Deals Changes Every Hour. Check Out The Current Deals On The Landing Page.", "link": "https://amzn.to/3bce9ZM?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Trimmers & Grooming – Upto 70% Off On Trimmers, Shavers & More", "description": "Get Upto 70% Off On Top Selling Trimmers & Grooming Brands Listed On The Deal Page. Offer Includes Brands Like Philips, Panasonic, Nova, Maxel & Many More. Discount May Vary From Product To Product. Visit Landing Page To Know More.", "link": "https://amzn.to/3FtBQI4?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Air Coolers – Minimum 10% To 50% Off On Bajaj, Symphony, Crompton, Kenstar & More Brands", "description": "Now Get Min 10% To 50% Off On Branded Air Coolers Shown On The Offer Page. Offer Includes Brands Such As Symphony, Bajaj, Crompton, Orient, Kenstar & Many More Brands. Visit Landing Page To Know More.", "link": "https://amzn.to/3cS7uEw?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Home Decor – Upto 85% Off On Wide Range Of Home Decor Products", "description": "Now Get Upto 85% Off On Home Decor Products Shown On The Catalog Page Includes Clocks, Decorative stickers, Home décor accents, Photo frames, Artwork, Mirrors, Seasonal decorations & More. Visit The Landing Page To Know More.", "link": "https://amzn.to/3fEDEVp?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Speakers Store – Min 25% Off On Speakers + No Cost EMI", "description": "Now Get Minimum 25% Off On Top Selling Speakers Like JBL, Philips, Sony, Bose, Portronics & Many More. Products Are Already At Discounted Price. Visit Landing Page To Know More.", "link": "https://amzn.to/3PRezDs?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Pocket Friendly Store – Fashion & Lifestyle Products Under Rs.499 Only", "description": "Shop On Pocket-Friendly Store On Amazon & Shop For Fashion & Lifestyle Products Under Rs.499 Only. Shop For Men’s Women’s & Kid’s Clothing, Footwear, Accessories, Beauty Products On More. Visit The Landing Page To Know More.", "link": "https://amzn.to/3OEyeWg?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Dry Fruits – Upto 70% Off On Happilo, Neuherbs, Vedaka & More Brands", "description": "Avail Upto 70% Off On Dry Fruits On Amazon. Shop For Almonds, Apricots, Cashews, Raisins, Pistachios & More From Brands Like Happilo, Neuherbs, Vedaka & More. Visit Landing Page To Know More.", "link": "https://amzn.to/3UhLtzW?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Home Furnishing – Upto 70% Off On Bedsheets, Curtains & More", "description": "Now Get Upto 70% Off On Home Furnishing Such As Bedsheets, Curtains, Towels, Pillows, Pillow Covers & Many More. Visit Landing Page To Know More.", "link": "https://amzn.to/3OJ1rz9?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Vacuum Cleaner – Upto 60% Off On Vacuum Cleaner + No Cost EMI", "description": "Now Avail Upto 60% Off On Vacuum Cleaners From Top Brands As Shown On The Offer Page. Includes Brands Like Dyson, Karcher, Inalsa Black & Decker & More. Visit Landing Page To Know More.", "link": "https://amzn.to/3zE4sN2?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "OnePlus 10 Pro – Flat Rs.5,000 Off + Exchange & No-Cost EMI", "description": "Avail Flat Rs.5000 Off On OnePlus 10 Pro Only At Amazon. Avail Exchange Offers & No-Cost EMI Offers From Top Banks. Visit Landing Page To Know More.", "link": "https://amzn.to/3zcI9wj?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "OppoVerse Days – Upto 30% Off + Extra 10% ICICI Off + Exchange & No Cost EMI", "description": "Now Get Upto 30% Off On Oppo Smartphones & Accessories. Choose From Latest Oppo Smartphones Like A7, Reno Series, A9, F11, A5 & Much More. Also Get Extra 10% Off On ICICI Cards Transactions. Minimum Purchase Of Rs.5,000 Required, Maximum Discount Of Rs.2,000 Can Be Availed. Discount May Vary From Product To Product. Also Get Additional Coupon Discount. Check Product Page To Coollect The Coupon. Visit Landing Page To Know More.", "link": "https://amzn.to/3voZ1Pj?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Vivo Smartphones – Starting At Rs.8,499 Off + Exchange & No Cost EMI", "description": "Now Shop For Vivo Smartphones, Starting At Rs.8,499 At Amazon. No Coupon Code Required To Grab This Offer. Visit Landing Page To Know More.", "link": "https://amzn.to/3OH2mQH?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Pocket Friendly Store – Mobile Accessories & More Starting At Rs.99", "description": "Now Get Best Deals On Mobile Accessories & More On Amazon. Shop For Headsets, Data Cables Mobile Chargers & More. No Coupon Code Required. Check out The Landing Page To Grab The Offer.", "link": "https://amzn.to/3S5ZRu8?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Amazon Fashion Clearance Store – Flat 50% To 80% Off On Clothing, Footwear & Accessories", "description": "Explore Amazon Fashion Clearance Store And Get Flat 50% To 80% Off On Clothing, Footwear And Accessories. Visit The Landing Page To Explore The Collection.", "link": "https://amzn.to/3oz0ZZK?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Clearance Store – Upto 70% Off On Electronics & Accessories", "description": "Now Avail Upto 70% Off On Electronics And Accessories And More. Shop From Video Games, Luggage & Bags And More. Also Get No Cost EMI Offers On Few Products. Visit  The Landing Page To Grab The Offer.", "link": "https://amzn.to/3cJBjqE?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Big Brand Days – Upto 70% Off On Men’s Footwear & Accessories", "description": "Get Upto 70% Off On Men’s Footwear & Accessories. Offer Page Includes Top Brands Like American Tourister, Crocs, Timex & More. Checkout The Landing Page To Know More.", "link": "https://amzn.to/3b9m5Ll?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Home Store – Home Furnishing, Storage & More Starting At Rs.99 Only", "description": "Get Best Deals On Home Improvement Products Like Home Furnishing, Home Storage, Curtains, Pillows, Candles & More At Amazon Home Store Starting At Rs.99 Only. Visit The Offer Page To Grab The Deals.", "link": "https://amzn.to/3BuibqX?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Top Deals – Headphones, Smartwatches & Other Accessories Under Rs.1499", "description": "Now Get Headphones, Smartwatches & Other Accessories Under Rs.1499. Offer Page Includes Brands Like Boult, Zebronics, Noise, Sandisk & More. Visit The Landing Page To Grab The Offer.", "link": "https://amzn.to/3BoEwX4?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Personal & Healthcare – Upto 70% Off On Wide Range Of Products", "description": "Get Upto 70% Off On Personal Care, Health & Fitness Products Such As Diet & Nutrition, Household Supplies, Personal Care, Health Care Products & More. Select From Wide Range Of Products Shown On the Catalog Page. Discount May Vary From Product To Product.", "link": "https://amzn.to/3cPSB5A?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Household Products & Supplies – Upto 50% Off On Cleaners, Laundry Detergents, Dishwash & More", "description": "Now Get Upto 50% Off On Household Products & Supplies Only At Amazon. Cleaners, Laundry Detergents, Dishwash & More. Offer Page Also Includes Combo Packs & Other Great Deals. Visit The Landing Page To Bag Products At Best Discounted Price.", "link": "https://amzn.to/3oCdCTN?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Under 999 Store – Cookware & Dining From Top Brands Under Rs.999", "description": "Explore Cookware, Bakeware, Kitchen Storage, Tools, Dining & More From Top Brands; All Under Rs.999. Visit The Landing Page To Grab The Offer.", "link": "https://amzn.to/3OAqK6F?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Sunglasses – Upto 70% Off On Branded Sunglasses", "description": "Now Get Upto 70% Off On Branded Sunglasses Shown On The Deal Page. Offer Includes Brands Such As Ray-Ban, Fastrack, IDEE, Oakley, Polaroid, Calvin Klein, UCB, Police & Many More. Visit The Landing Page To Avail The Offer Now.", "link": "https://amzn.to/3vnmxMC?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Bags & Luggage – Upto 70% Off On On Bags, Wallets & More", "description": "Now Get Upto 70% Off On Bags, Wallets & Luggage Of Top Brands Such As American Tourister, Skybags, Tommy Hilfiger, Gear And Many More Shown On The Catalog Page. No Coupon Code Required. Products Listed Are Already Discounted. Check Out The Offer Page For More Details.", "link": "https://amzn.to/3oC2Mxc?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Sports Shoes – Upto 70% Off On From Puma, Campus & More", "description": "Now Avail Sports Shoes From Brands Like Puma, Adidas, Asics, Campus Shoes & More And Get Upto 70% Off. No Coupon Code Required. Visit The Landing Page To Explore More.", "link": "https://amzn.to/3oDDlvd?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Best Selling Headphones Starting From Rs.349 Onwards", "description": "Now Avail Best Selling Headphones Starting From Rs.349 Onwards Shown On The Offer Page. Offer Includes Brands Such As Boat, Oneplus, JBL, Redmi, Philips, Sony And Many More. Check Out The Offer Page For More Details.", "link": "https://amzn.to/3cK0Foj?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Computer Accessories – Upto 70% Off On Mouse, Keyboard, Headphones & More + No Cost EMI Offer", "description": "Now Get Upto 70% Off On Computer Accessories Only At Amazon. Offer Includes Such As Mouse, Keyboard, Headphones, Gamepads & Many More Shown On The Deal Page. Visit The Landing Page To Avail The Offer Now.", "link": "https://amzn.to/3zF5dWf?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Storage Devices – Min 25% Off + No Cost EMI & Exchange", "description": "Now Get Min 25% Off On Data Storage products such as Hard Drives, Pen Drives & Memory Cards Shown On The Offer Page. Get The Best Offers On Brands Like Sandisk, Seagate, WD Elements And More. Visit The Landing Page For More Details.", "link": "https://amzn.to/3b7QR7m?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Clearance Store – Minimum 25% Off On Home & Kitchen Appliances", "description": "Now Avail Minimum 25% Off On Home, Kitchen Appliances, Vehicle Care Parts & Accessories & More. Also Get No Cost EMI Offers On A Few Products. Visit The Landing Page To Know More.", "link": "https://amzn.to/3OFmcvJ?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Smart Home Days – Upto 50% Off On Smart Home Products", "description": "Now Get Upto 50% Off On Smart Home Products On Amazon. Shop From Smart Lightings, Smart Plugs, Smart Speakers And Many More. No Coupon Code Required. Visit The Landing Page For More Details.", "link": "https://amzn.to/3oAZuKx?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Make-Up Products & Accessories Starting At Rs.99", "description": "Now Shop For Makeup Products & Accessories On Amazon Starting At Rs.99 Only. Get Best Deals. Visit The Link To Grab The Deal.", "link": "https://amzn.to/3vlZOk4?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Gym Equipments – Upto 60% Off On Workout Equipments & Accessories", "description": "Now Get Upto 60% Off On Workout Equipments & Accessories On Amazon. No Coupon Code Required . Just Visit The Landing Page To Grab The Deal & For More Details.", "link": "https://amzn.to/3JfrtZF?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Amazon Fashion Coupons – Upto 20% Savings On Fashion & Lifestyle Products", "description": "Now Get Upto 20% Savings Coupons On Fashion & Lifestyle Products From Top Brands At Amazon. Check Out All Coupons For Today At The Offer Page. Just Select The Offer Which You Are Interested & Click on Collect Coupon Button, The Coupon Will Be Automatically Applied At The Time Of Payment.", "link": "https://amzn.to/2QzWkXk?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Oneplus Band – Flat Rs.1,400 Off Now Available At Rs.1,399 Only", "description": "Now Get Flat Rs.1,400 Off on Oneplus Band Now Available At Rs.1,399 Only At Amazon. Check Out The Offer Page For More Details & Specifications.", "link": "https://amzn.to/3Q0Y1cb?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Car & Bike Accessories – Upto 70% Off Products Starting At Rs.149 Only", "description": "Now Get Upto 70% Off On Car & Bike Accessories At Amazon. Choose From 50+ brands such as Woogor, Areon, etc, over 6 lakh products available here. Shop for Car Seat Covers, Car Covers, Car Mats and more. Visit The Landing Page For More Details.", "link": "https://amzn.to/3zDloDk?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Luxury Beauty Products – Upto 25% Off On Kama, Forest Essentials & More", "description": "Now Get Upto 25% Off On Top Beauty, Make Up and Skin Care Brands Such As Kama Ayurveda, Forest Essentials, Davidoff, Schwarzkopf, Carolina Herera & Many More. Visit The Landing Page for More Details.", "link": "https://amzn.to/3PNwkEc?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Diapers – Upto 30% Off On Baby Diapers", "description": "Now Get Upto 30% Off On Baby Diapers Shown On The Offer Page . Offer Includes Brands Such As Pampers, Huggies, Mamy Poko, Libero & Many More. Offer Valid On Diapers Listed Under The Catalog Only. Visit The Landing Page For More Details.", "link": "https://amzn.to/3PK264R?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Handbags & Clutches – Upto 70% Off On Top Brands", "description": "Now Get Upto 70% Off On Handbags & Clutches Shown On The Deal Page. Offer Includes Brands Such As Caprese, Lavie, Hidesign, Butterflies & Many More. Visit The Landing Page To Avail The Offer Now.", "link": "https://amzn.to/3zginHK?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Health & Fitness – Upto 60% Off On Proteins, Supplements, Personal Care Products & More", "description": "Now Get Upto 60% Off On Fitness & Sports Products-Such As Nutrition & Supplements, Blood Pressure Monitor, Body Massager, Pedometer And Many More From Brands Like – Accu Check, Fitbit, Omron, Etc. Visit The Offer Page To Know More.", "link": "https://www.amazon.in/b?ie=UTF8&node=12318976031&tag=offerscode-21&ascsubtag=HEALTHFITNESS&affid=vishwajit8", "merchant": "amazon"}, {"title": "Home Cleaning – Upto 60% Off + Top Deals On Moppers & Other Home Cleaning Products", "description": "Get Upto 60% Off On Home Cleaning Products such as Floor Moppers, Spin Moppers, Flat Moppers, Cleaning Gloves, Scrubbers and Much More. Offers On Products from Brands Like Scotch Brite, Gala, Max Home & More Available. Check Out the Bestsellers at the offer page.", "link": "https://amzn.to/3gE58WX?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Personal Safety Supplies Starting At Rs.149 Only", "description": "Now Get Best Deals On Health & Personal Care & More On Amazon Starting At Rs.149. No Coupon Code Required. Check out The Landing Page To Grab The Offer.", "link": "https://amzn.to/3QJ0IQg%20%20%20Amazon.in:%20:%20All%20Categories%20https://amzn.to?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Sports Essentials – Sports Products Now Under Rs.999", "description": "Now Get Sports Essentials Under Rs.999 Only Shown On The Offer Page. Offer Includes Brands Such As Nike, Nivia, Yonex, Cosco, SG & Many More. Check Out The Deal Page For More Details.", "link": "https://amzn.to/3oEG1J0?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Industrial Products – Upto 60% Off On Industrial Products", "description": "Now Get Upto 60% Off On Wide Range Of Power & Hand Tools. Offer Includes Drills, Rotary & hand Tool Kits, Screwdrivers & Many More. No Coupon Code required. Product Are Already Discounted. Visit The Landing Page For More Details.", "link": "https://amzn.to/3vnAsCq?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}, {"title": "Home Essentials – Upto 70% Off On Wide Range Of Products", "description": "Now Avail Upto 70% Off On Wide Range Of Home Essentials Products Such As Drying Racks, Ironing Boards, Pest Control, Power Cut Solutions, Decor & Furnishing Ideas And Much More. No Coupon Code Required As Products Are Already Discounted. Explore The Products By Visiting The Offer Page.", "link": "https://amzn.to/3OI7NyM?tag=offerscode-21&affid=vishwajit8", "merchant": "amazon"}]